# Introduction

In this project we will work with data from [CIA World Factbook](https://www.cia.gov/the-world-factbook/). This dataset contains statistical information about all the countries on earth.
It is commonly referred to as the Factbook and it contains demographic informations each information represented by a column. Some of which includes:

| column name | description |
| :---         |      :---  |
| name | the name of the country. |
| area | the country's total area (both land and water). |
| area_land |  the country's land area in square kilometers | 
| area_water | the country's waterarea in square kilometers. |
| population | the country's population. |
| population_growth | the country's population growth as a percentage. |
| birth_rate| the country's birth rate, or the number of births per year per 1,000 people. |
|death_rate | the country's death rate, or the number of death per year per 1,000 people. |

- population - the global population of the country.
- population_growth - the annual population growth rate, as a percentage.
- area - the total land and water area covered by the country

The data is stored in a table within an sqlite database.

### Aim
Our aim is to use SQL to analyze the data from the database by comming up with valuable insights.

In [57]:
# connect Jupyter notebook to database
# %%capture
%load_ext sql
%sql sqlite:///factbook.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: None@factbook.db'

In [58]:
%%sql
SELECT * 
FROM sqlite_master

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [59]:
%%sql
SELECT * 
    FROM facts
    LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Summary statistic

let's try to identify some abnormal countries by calculating some summary data

In [60]:
%%sql
SELECT MIN(population) as min_population,
MAX(population) as max_population,
MIN(population_growth) as min_population_growth,
MAX(population_growth) as max_population_growth
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

### Analysing Outlier countries

Can you Identify some odd values? Yes the min_population and the min_population_growth columns both have a value of 0

Also, there is a country with a population of about 7.2Billion people. I didn't know such a country exist

Next, let's try to understand which are those countries that have 0 inhabitants and why. Let's also Identify the country with the population of 7.2billion

In [61]:
%%sql 
SELECT *
FROM facts
WHERE population = (SELECT MIN(population)
                       FROM facts);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

Let's look at the country with the min popuplation growth as well

In [62]:
%%sql 
SELECT *
FROM facts
WHERE population = (SELECT MIN(population_growth)
                       FROM facts);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

We can see that Antarctica is the crazy country with no inhabitant. According to [Wikipedia](https://en.wikipedia.org/wiki/Antarctica) Antartica is the coldest, driest, and windiest continent, and has the highest average elevation of all the continents. This conditions makes it impossible for human habitation

Now that we understand the reason behind the country with 0 population, let's look into the country with a more than a billion population

In [63]:
%%sql 
SELECT *
FROM facts
WHERE population = (SELECT MAX(population)
                       FROM facts);

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

Ooops!! it looks like we have gotten our country, the world. However, we all know that the world is not a country. It just happens that the team who worked on the dataset decided to include a row for the whole world.

Now that we have our two exceptions, let's recompute the above statistic while excluding them.

In [64]:
%%sql
SELECT MIN(population) as min_population,
MAX(population) as max_population,
MIN(population_growth) as min_population_growth,
MAX(population_growth) as max_population_growth
FROM facts
WHERE name NOT IN ('World', 'Antarctica');

Done.

[(48, 1367485388, 0.0, 4.02)]

In [65]:
%%sql 
SELECT *
FROM facts
WHERE population = 48;

Done.

[(238, 'pc', 'Pitcairn Islands', 47, 47, 0, 48, 0.0, None, None, None)]

The smallest country aside Antartica is Pitcairn Island with a population of 47 people.
You can read read more about it here [Pitcairn Island](https://www.government.pn/)

There is a country with a population of 1.4Billion, we can all guess right? China

## Exploring Population Density

let's determine the average country's population and the average country's area

In [66]:
%%sql
SELECT AVG(population) as avg_population,
AVG(area) as avg_area
FROM facts
WHERE name NOT IN ('World');

Done.

[(32242666.56846473, 555093.546184739)]

One interesting calculation we can do now is determining the countries that are over populated.

We can do that by identifying countries:
 - that falls below the average area
 - whose populations is above the average

In [67]:
%%sql
SELECT * 
FROM facts
WHERE area < (SELECT AVG(area)
                    FROM facts
                    WHERE name NOT IN ('World'))
AND population > (SELECT AVG(population)
                    FROM facts
                    WHERE name NOT IN ('World'));

Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

We can be sure of our result since most of this countries are generally considered densily populated

### Exploring the land to water area proportion

Let's look at the various countries and Identify those whose total area is mainly composed of water

In [68]:
%%sql
SELECT *, (area_water - area_land) as difference_water_land 
FROM facts
ORDER BY difference_water_land DESC
LIMIT 10 ;

Done.

[(228, 'io', 'British Indian Ocean Territory', 54400, 60, 54340, None, None, None, None, None, 54280),
 (247, 'vq', 'Virgin Islands', 1910, 346, 1564, 103574, 0.59, 10.31, 8.54, 7.67, 1218),
 (190, 'vt', 'Holy See (Vatican City)', 0, 0, 0, 842, 0.0, None, None, None, 0),
 (117, 'mn', 'Monaco', 2, 2, 0, 30535, 0.12, 6.65, 9.24, 3.83, -2),
 (201, 'cr', 'Coral Sea Islands', 3, 3, 0, None, None, None, None, None, -3),
 (198, 'at', 'Ashmore and Cartier Islands', 5, 5, 0, None, None, None, None, None, -5),
 (244, 'bq', 'Navassa Island', 5, 5, 0, None, None, None, None, None, -5),
 (253, 'pg', 'Spratly Islands', 5, 5, 0, None, None, None, None, None, -5),
 (208, 'ip', 'Clipperton Island', 6, 6, 0, None, None, None, None, None, -6),
 (233, 'gi', 'Gibraltar', 6, 6, 0, 29258, 0.24, 14.08, 8.37, 3.28, -6)]

British Indian Ocean Territory's water area 900 times larger than the land area.
Also, we can observe that the top 10 countries with this characteristic are mainly Island, which is not surprising.

### End of Analysis